In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql postgresql://postgres:SanchezZamudio@localhost:5432/postgres

'Connected: postgres@postgres'

## Problems

### Problem 1

##### Problem 1: Find the total number of crimes recorded in the CRIME table

In [9]:
%%sql
SELECT count("ID") as "number of crimes"
from chicago_crime_data;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(533,)]

#### Problem 2:
##### List community areas with per capita income less than 11000.

In [15]:
%%sql
SELECT ca, community_area_name, per_capita_income_
from chicago_socioeconomic_data
where per_capita_income_ < 11000

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[(26.0, 'West Garfield Park', 10934),
 (30.0, 'South Lawndale', 10402),
 (37.0, 'Fuller Park', 10432),
 (54.0, 'Riverdale', 8201)]

### Problem 3: 
#### List all case numbers for crimes  involving minors?

In [20]:
%%sql
SELECT "CASE_NUMBER", "DESCRIPTION"
from chicago_crime_data
where "DESCRIPTION" like '%mino%' 
or  "DESCRIPTION" like '%MINO%' ;

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('HL266884', 'SELL/GIVE/DEL LIQUOR TO MINOR'),
 ('HK238408', 'ILLEGAL CONSUMPTION BY MINOR')]

### Problem 4: 
#### List all kidnapping crimes involving a child?

In [29]:
%%sql
SELECT "CASE_NUMBER", "PRIMARY_TYPE","DESCRIPTION"
from chicago_crime_data
where "PRIMARY_TYPE" like '%KIDNAPPING%'
and "DESCRIPTION" like '%CHILD%';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

### Problem 5: 
#### What kind of crimes were recorded at schools?

In [34]:
%%sql
SELECT "PRIMARY_TYPE", "LOCATION_DESCRIPTION"
from chicago_crime_data
where "LOCATION_DESCRIPTION" like '%SCHOOL%'
group by "PRIMARY_TYPE", "LOCATION_DESCRIPTION";

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[('ASSAULT', 'SCHOOL, PUBLIC, GROUNDS'),
 ('BATTERY', 'SCHOOL, PUBLIC, BUILDING'),
 ('BATTERY', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL DAMAGE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL TRESPASS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, BUILDING'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PRIVATE, BUILDING'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PUBLIC, BUILDING')]

### Problem 6: 
#### List the average safety score for all types of schools.

In [39]:
%%sql
SELECT "Elementary, Middle, or High School", AVG("SAFETY_SCORE") as "average safety score"
from chicago_schools_data
group by "Elementary, Middle, or High School";

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('HS', 49.62352941176471), ('MS', 48.0), ('ES', 49.52038369304557)]

### Problem 7: 
#### List 5 community areas with highest % of households below poverty line.

In [41]:
%%sql
SELECT ca, community_area_name, percent_households_below_poverty
from chicago_socioeconomic_data
order by percent_households_below_poverty DESC
limit 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(54.0, 'Riverdale', 56.5),
 (37.0, 'Fuller Park', 51.2),
 (68.0, 'Englewood', 46.6),
 (29.0, 'North Lawndale', 43.1),
 (27.0, 'East Garfield Park', 42.4)]

### Problem 8: 
#### Which community area(number) is most crime prone?

In [57]:
%%sql
SELECT csd.ca, csd.community_area_name, count("ID")
from chicago_socioeconomic_data csd
JOIN  chicago_crime_data  ccd
on ccd."COMMUNITY_AREA_NUMBER" = csd.ca
group by csd.ca, csd.community_area_name
order by count("ID") DESC
limit 1;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(25.0, 'Austin', 43)]

### Problem 9: 
#### Use a sub-query to find the name of the community area with highest hardship index.

In [58]:
%%sql
SELECT csd.ca, csd.community_area_name, hardship_index
from chicago_socioeconomic_data csd
where hardship_index = (SELECT  MAX(hardship_index) from chicago_socioeconomic_data csd);

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(54.0, 'Riverdale', 98.0)]

### Problem 10: 
#### Use a sub-query to determine the Community Area Name with most number of crimes?

In [59]:
%%sql
SELECT csd.ca, csd.community_area_name
from chicago_socioeconomic_data csd
where csd.community_area_name = (SELECT  csd.community_area_name
from chicago_socioeconomic_data csd
JOIN  chicago_crime_data  ccd
on ccd."COMMUNITY_AREA_NUMBER" = csd.ca
group by csd.ca, csd.community_area_name
order by count("ID") DESC
limit 1);

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(25.0, 'Austin')]